hard_cases = [
    '他在衬衫外套了件外套。',
    '这名研究生命大。',
    '结婚的和尚未结婚的人。',
    '这件和服务必于今日前裁剪完毕。',
    '爱尔兰人才小气！',
    '那是个别人，不代表众多的人！',
    '黄鹤之飞尚不得过，猿猱欲度愁攀援。',
    '信噪比较高。',
    '就在上官婉儿去世两年后的712年，李隆基登基',
    '在石油化工发达的国家已大幅取代了乙炔水合法。',
    '这是一件喜大普奔的大事件！',
]

long_cases = [
    '人要是行，干一行行一行一行行行行行要是不行干一行不行一行一行不行行行不行',
    '黄鹤之飞尚不得过，猿猱欲度愁攀援。青泥何盘盘，百步九折萦岩峦。扪参历井仰胁息，以手抚膺坐长叹。问君西游何时还？畏途巉岩不可攀。猿猱欲渡愁攀援。',
    '1759年，詹姆斯·瓦特开始设计蒸汽机，屡经失败。瓦特向格拉斯哥大学的教授约瑟夫·布拉克求教。布拉克向其讲解了自己提出的热容和潜热的概念，瓦特还想出了分离冷凝器的想法，终于显著提高了蒸汽机的效率[a]。尼古拉·卡诺总结前人工作，在1824年发表著作《论火的动力》。这部著作论述了卡诺热机和卡诺循环的关系。这部著作是热力学成为现代科学的标志，卡诺也被称作热力学之父。',
    '甾体激素相关研究[编辑]1958年，黄鸣龙利用薯蓣皂甙元为原料，用微生物氧化加入11α－羟基和用氧化钙－碘－醋酸钾加入C21－OAc的方法，七步合成了可的松。[8] 有了合成可的松的工业基础，60年代初期，许多重要的甾体激素如黄体素、睾丸素、强的松和地塞米松等，都在先后生产出来。黄鸣龙对甲地孕酮的合成方法进行了改进，他改进的方法只要3步，总收率达40％。这一改进不但有一定经济价值，并且也有一定理论意义。他还首先发现了甲地孕酮的避孕作用。[9]'
]

funny_cases = [
    '一把把把把住了。',
    '根据碳碳键键能能否否定定律一或定律二',
    '校服上除了别针别别别的',
    '货拉拉拉不拉拉布拉多取决于拉布拉多拉不拉屎',
    '差点没上上上上海的车',
]

ancient_cases = [
    '必待一书毕然后方换一书，并不得兼读他书及省遍数。',
    '夫计谋欲密，攻敌欲疾，获若鹰击，战如河决，则兵未劳而敌自散，此用兵之势也。',
    '晋太元中，武陵人捕鱼为业，缘溪行，忘路之远近。忽逢桃花林，夹岸数百步，中无杂树，芳草鲜美，落英缤纷，渔人甚异之。复前行，欲穷其林。林尽水源，便得一山，山有小口，仿佛若有光，便舍船从口入。初极狭，才通人，复行数十步，豁然开朗。土地平旷，屋舍俨然，有良田美池桑竹之属。阡陌交通，鸡犬相闻。其中往来种作，男女衣著，悉如外人。黄发垂髫，并怡然自乐。'
    '见渔人，乃大惊，问所从来。具答之。便要还家，设酒杀鸡作食。村中闻有此人，咸来问讯。自云先世避秦时乱，率妻子邑人来此绝境，不复出焉，遂与外人间隔。问今是何世，乃不知有汉，无论魏晋。此人一一为具言所闻，皆叹惋。余人各复延至其家，皆出酒食。停数日，辞去。'
    '此中人语云，不足为外人道也。既出，得其船，便扶向路，处处志之。及郡下，诣太守说如此。太守即遣人随其往，寻向所志，遂迷不复得路。南阳刘子骥，高尚士也，闻之，欣然规往，未果。寻病终。后遂无问津者。'
]